---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlanViewViewDir
source: html/77ce5f18-d70d-39a2-d91b-e46bb074282a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlanViewViewDir Property

"View Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId PlanViewViewDir { get; }
```